NordicSemiconductor/nRF5-SDK-for-Mesh/models/config/include/config_messages.h
/* Copyright (c) 2010 - 2017, Nordic Semiconductor ASA
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *
 * 1. Redistributions of source code must retain the above copyright notice, this
 * list of conditions and the following disclaimer.
 *
 * 2. Redistributions in binary form, except as embedded into a Nordic
 *    Semiconductor ASA integrated circuit in a product or a software update for
 *    such product, must reproduce the above copyright notice, this list of
 *    conditions and the following disclaimer in the documentation and/or other
 *    materials provided with the distribution.
 *
 * 3. Neither the name of Nordic Semiconductor ASA nor the names of its
 *    contributors may be used to endorse or promote products derived from this
 *    software without specific prior written permission.
 *
 * 4. This software, with or without modification, must only be used with a
 *    Nordic Semiconductor ASA integrated circuit.
 *
 * 5. Any software provided in binary form under this license must not be reverse
 *    engineered, decompiled, modified and/or disassembled.
 *
 * THIS SOFTWARE IS PROVIDED BY NORDIC SEMICONDUCTOR ASA "AS IS" AND ANY EXPRESS
 * OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
 * OF MERCHANTABILITY, NONINFRINGEMENT, AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL NORDIC SEMICONDUCTOR ASA OR CONTRIBUTORS BE
 * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE
 * GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
 * HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT
 * OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

#ifndef CONFIG_MESSAGES_H__
#define CONFIG_MESSAGES_H__

#include <stddef.h>
#include <stdint.h>

#include "nrf_mesh_assert.h"

/**
 * @defgroup CONFIG_MESSAGES Message formats
 * @ingroup CONFIG_MODEL
 * Message format definitions for the Config models.
 * @{
 */

/** Maximum re-transmit count. */
#define CONFIG_RETRANSMIT_COUNT_MAX          ((1 << 3) - 1)
/** Maximum number of re-transmit interval steps. */
#define CONFIG_RETRANSMIT_INTERVAL_STEPS_MAX ((1 << 5) - 1)
/** Gets the retransmit interval in milliseconds from the number of steps. */
#define CONFIG_RETRANSMIT_INTERVAL_STEP_TO_MS(STEP) ((STEP) * 10)
/** Gets the retransmit interval steps from the interval in milliseconds. */
#define CONFIG_RETRANSMIT_INTERVAL_MS_TO_STEP(MS)   ((MS) / 10)

/*lint -align_max(push) -align_max(1) */

/**
 * 24-bit key index type.
 * Provides two 12-bit key indexes in three bytes. Use the dedicated functions
 * to manipulate this structure.
 * @see config_msg_key_index_24_set(), config_msg_key_index_24_get()
 */
typedef struct __attribute((packed))
{
    uint8_t key_id_1_lsb;     /**< 8 LSB of the first key index. */
    uint8_t key_id_1_msb : 4; /**< 4 MSB of the first key index. */
    uint8_t key_id_2_lsb : 4; /**< 4 LSB of the second key index. */
    uint8_t key_id_2_msb;     /**< 8 MSB of the second key index. */
} config_msg_key_index_24_t;

/* Ensure the size of the above type is correct: */
NRF_MESH_STATIC_ASSERT(sizeof(config_msg_key_index_24_t) == 3);

/**
 * Sets the value of the keys in a 24-bit index struct.
 * @param[out] p_idx24  Pointer to a 24-bit key index structure.
 * @param[in]  key_id_1 Value to assign to the first key index in the struct.
 * @param[in]  key_id_2 Value to assign th the second key index in the struct.
 */
static inline void config_msg_key_index_24_set(config_msg_key_index_24_t * p_idx24, uint16_t key_id_1, uint16_t key_id_2)
{
    p_idx24->key_id_1_lsb = key_id_1 & 0xff;
    p_idx24->key_id_1_msb = (key_id_1 >> 8) & 0xf;

    p_idx24->key_id_2_lsb = key_id_2 & 0xf;
    p_idx24->key_id_2_msb = (key_id_2 >> 4) & 0xff;
}

/**
 * Gets the value of one or both of the keys in a 24-bit index struct.
 * @param[in]  p_idx24    Pointer to a 24-bit key index structure.
 * @param[out] p_key_id_1 Pointer to where the first key index in the struct should be returned.
 *                        This parameter can be set to @c NULL to skip retrieving the first key ID.
 * @param[out] p_key_id_2 Pointer to where the second key index in the struct should be returned.
 *                        This parameter can be set to @c NULL to skip retrieveing the second key ID.
 */
static inline void config_msg_key_index_24_get(const config_msg_key_index_24_t * p_idx24, uint16_t * p_key_id_1, uint16_t * p_key_id_2)
{
    if (p_key_id_1 != NULL)
    {
        *p_key_id_1 = p_idx24->key_id_1_lsb | (p_idx24->key_id_1_msb << 8);
    }

    if (p_key_id_2 != NULL)
    {
        *p_key_id_2 = p_idx24->key_id_2_lsb | (p_idx24->key_id_2_msb << 4);
    }
}

/** Mask used for setting or extracting 12-bit key indexes. */
#define CONFIG_MSG_KEY_INDEX_12_MASK    0x0fff

/**
 * 12-bit key index type.
 * This provides room to store one 12-bit key in two bytes. Use the dedicated functions
 * to manipulate this structure.
 */
typedef uint16_t config_msg_key_index_12_t;

/**
 * Model ID type for configuration messages.
 * This is used in messages that can either contain a 16-bit SIG identifier or
 * a 32-bit vendor-specific model ID. For SIG identifiers the company_id is ignored.
 */
typedef struct __attribute((packed))
{
    uint16_t model_id;     /**< Model ID. */
    uint16_t company_id;   /**< Vendor-specific company ID. */
} config_model_id_t;
NRF_MESH_STATIC_ASSERT(sizeof(config_model_id_t) == sizeof(uint32_t));

/** Message format for the AppKey Add message. */
typedef struct __attribute((packed))
{
    config_msg_key_index_24_t key_indexes; /**< Pair containing a netkey and an appkey index. */
    uint8_t appkey[NRF_MESH_KEY_SIZE];     /**< Application key data. */
} config_msg_appkey_add_t;

