NordicSemiconductor/nRF5-SDK-for-Mesh/models/config/include/config_messages.h
/** Message format for the AppKey Update message. */
typedef struct __attribute((packed))
{
    config_msg_key_index_24_t key_indexes; /**< Pair containing a netkey and an appkey index. */
    uint8_t appkey[NRF_MESH_KEY_SIZE];     /**< Application key data. */
} config_msg_appkey_update_t;

/** Message format for the AppKey Delete message. */
typedef struct __attribute((packed))
{
    config_msg_key_index_24_t key_indexes; /**< Pair containing a netkey and an appkey index. */
} config_msg_appkey_delete_t;

/** Message format for the AppKey Status message. */
typedef struct __attribute((packed))
{
    uint8_t status;                        /**< Status code. */
    config_msg_key_index_24_t key_indexes; /**< Pair containing a netkey and an appkey index. */
} config_msg_appkey_status_t;

/** Message format for the AppKey Get message. */
typedef struct __attribute((packed))
{
    config_msg_key_index_12_t netkey_index; /**< Network key to report application keys for. */
} config_msg_appkey_get_t;

/** Message format for the AppKey List message. */
typedef struct __attribute((packed))
{
    uint8_t status;                         /**< Status code. */
    config_msg_key_index_12_t netkey_index; /**< Network key index. */
    uint8_t packed_appkey_indexes[];        /**< Packed list of application key indexes. */
} config_msg_appkey_list_t;

/** Message format for the Default TTL Set and Get messages. */
typedef struct __attribute((packed))
{
    uint8_t ttl;            /**< Default TTL value. */
} config_msg_default_ttl_t;

/** Possible values for the network beacon state. */
typedef enum
{
    CONFIG_NET_BEACON_STATE_ENABLED = 0, /**< The network beacon is enabled. */
    CONFIG_NET_BEACON_STATE_DISABLED = 1 /**< The network beacon is disabled. */
} config_net_beacon_state_t;

/** Message format for the Config Beacon Set message. */
typedef struct
{
    uint8_t beacon_state;      /**< Beacon state. */
} config_msg_net_beacon_set_t;

/** Message format for the Config Beacon Status message. */
typedef struct __attribute((packed))
{
    uint8_t beacon_state;      /**< Beacon state. */
} config_msg_net_beacon_status_t;

/** Publication parameters. */
typedef struct __attribute((packed))
{
    uint16_t appkey_index : 12;                   /**< Application key index. */
    uint16_t credential_flag : 1;                 /**< Friendship credentials flag. */
    uint16_t rfu : 3;                             /**< Reserved for future use, set to 0. */
    uint8_t  publish_ttl;                         /**< TTL for outgoing messages. */
    uint8_t  publish_period;                      /**< Period for periodic publishing. */
    uint8_t  retransmit_count : 3;                /**< Number of retransmissions of each message. */
    uint8_t  retransmit_interval : 5;             /**< Number of 50 ms steps between each retransmission. */
    config_model_id_t  model_id;                  /**< Model identifier. */
} config_publication_params_t;

/** Message format for the Model Publication Get message. */
typedef struct __attribute((packed))
{
    uint16_t element_address;   /**< Address of the element. */
    config_model_id_t model_id; /**< Identifier of the model. */
} config_msg_publication_get_t;

/** Message format for the Model Publication Set message. */
typedef struct __attribute((packed))
{
    uint16_t element_address;          /**< Unicast address of the element. */
    uint16_t publish_address;          /**< Publish address. */
    config_publication_params_t state; /**< The publication parameters to set. */
} config_msg_publication_set_t;

/** Message format for the Model Publication Virtual Set message. */
typedef struct __attribute((packed))
{
    uint16_t element_address;                  /**< Unicast address of the element. */
    uint8_t  publish_uuid[NRF_MESH_UUID_SIZE]; /**< Virtual address label UUID. */
    config_publication_params_t state;         /**< The publication parameters to set. */
} config_msg_publication_virtual_set_t;

/** Message format for the Model Publication Status message. */
typedef struct __attribute((packed))
{
    uint8_t status;                    /**< Status code. */
    uint16_t element_address;          /**< Unicast address of the element. */
    uint16_t publish_address;          /**< Publish address. */
    config_publication_params_t state; /**< Current publication parameters. */
} config_msg_publication_status_t;

/** Message format for the Model Subscription Add/Delete/Overwrite messages. */
typedef struct __attribute((packed))
{
    uint16_t          element_address; /**< Address of the element. */
    uint16_t          address;         /**< Address to subscribe to. */
    config_model_id_t model_id;        /**< ID of the model. */
} config_msg_subscription_add_del_owr_t;

/** Message format for the Model Subscription Virtual Add/Delete/Overwrite messages. */
typedef struct __attribute((packed))
{
    uint16_t          element_address;                  /**< Address of the element. */
    uint8_t           virtual_uuid[NRF_MESH_UUID_SIZE]; /**< Label UUID for the virtual address to subscribe to. */
    config_model_id_t model_id;                         /**< ID of the model. */
} config_msg_subscription_virtual_add_del_owr_t;

/** Message format for the Model Subscription Delete All message. */
typedef struct __attribute((packed))
{
    uint16_t          element_address; /**< Address of the element. */
    config_model_id_t model_id;        /**< ID of the model. */
} config_msg_subscription_delete_all_t;

/** Message format for the Model Subscription Status message. */
typedef struct __attribute((packed))
{
    uint8_t           status;          /**< Status code. */
    uint16_t          element_address; /**< Address of the element. */
    uint16_t          address;         /**< Address that the model was subscribed to. */
    config_model_id_t model_id;        /**< ID of the model. */
} config_msg_subscription_status_t;

/** Message format for the Network Key Add/Update messages. */
typedef struct __attribute((packed))
{
    config_msg_key_index_12_t netkey_index;              /**< Network key index. */
    uint8_t                   netkey[NRF_MESH_KEY_SIZE]; /**< Network key contents. */
} config_msg_netkey_add_update_t;

