NordicSemiconductor/nRF5-SDK-for-Mesh/models/config/include/config_messages.h
/** Message format for the Network Key Delete message. */
typedef struct __attribute((packed))
{
    config_msg_key_index_12_t netkey_index; /**< Network key index. */
} config_msg_netkey_delete_t;

/** Message format for the Network Key Status message. */
typedef struct __attribute((packed))
{
    uint8_t status;                         /**< Status code. */
    config_msg_key_index_12_t netkey_index; /**< Network key index.*/
} config_msg_netkey_status_t;

/** Possible values for the GATT Proxy state. */
typedef enum
{
    CONFIG_GATT_PROXY_STATE_RUNNING_DISABLED = 0x00, /**< The GATT proxy is running, but disabled. */
    CONFIG_GATT_PROXY_STATE_RUNNING_ENABLED  = 0x01, /**< The GATT proxy is running and enabled. */
    CONFIG_GATT_PROXY_STATE_UNSUPPORTED      = 0x02  /**< The GATT proxy feature is not supported. */
} config_gatt_proxy_state_t;

/** Message format for the GATT Proxy Status message. */
typedef struct __attribute((packed))
{
    uint8_t proxy_state; /**< The state of the GATT proxy service. */
} config_msg_proxy_status_t;

/** Message format for the GATT Proxy Set message. */
typedef struct __attribute((packed))
{
    uint8_t proxy_state; /**< The desired state of the GATT proxy service. */
} config_msg_proxy_set_t;

/** Possible values for the Friend state. */
typedef enum
{
    CONFIG_FRIEND_STATE_SUPPORTED_DISABLED = 0x00, /**< Friendship is supported, but disabled. */
    CONFIG_FRIEND_STATE_SUPPORTED_ENABLED  = 0x01, /**< Friendship is supported and enabled. */
    CONFIG_FRIEND_STATE_UNSUPPORTED        = 0x02  /**< Friendship is not supported. */
} config_friend_state_t;

/** Message format for the Friend Set message. */
typedef struct __attribute((packed))
{
    uint8_t friend_state; /**< The desired state of the friendship feature. */
} config_msg_friend_set_t;

/** Message format for the Friend Status message. */
typedef struct __attribute((packed))
{
    uint8_t friend_state; /**< The state of the friendship feature. */
} config_msg_friend_status_t;

/** Message format for the Key Refresh Phase Get message. */
typedef struct __attribute((packed))
{
    config_msg_key_index_12_t netkey_index; /**< Index of the network to get the key refresh phase for. */
} config_msg_key_refresh_phase_get_t;

/** Message format for the Key Refresh Phase Set message. */
typedef struct __attribute((packed))
{
    config_msg_key_index_12_t netkey_index; /**< Index of the network to set the key refresh phase for. */
    uint8_t transition;                     /**< ID of the phase to transition to. */
} config_msg_key_refresh_phase_set_t;

/** Message format for the Key Refresh Phase Status message. */
typedef struct __attribute((packed))
{
    uint8_t status;                         /**< Status code. */
    config_msg_key_index_12_t netkey_index; /**< Index of the network the key refresh phase is reported for. */
    uint8_t phase;                          /**< Current key refresh phase for the subnet. */
} config_msg_key_refresh_phase_status_t;

/** Message format for the Heartbeat Publication Set message*/
typedef struct __attribute((packed))
{
    uint16_t destination;                   /**< Heartbeat publication destination. */
    uint8_t count_log;                      /**< Number of heartbeat messages to be sent. */
    uint8_t period_log;                     /**< Period of transmitted heartbeat messages. */
    uint8_t ttl;                            /**< TTL for heartbeat message. */
    uint16_t features;                      /**< Features triggering heartbeat messages. */
    config_msg_key_index_12_t netkey_index; /**< Index for the network key used to send heartbeats. */
} config_msg_heartbeat_publication_set_t;

/** Message format for the Heartbeat Publication Status message. */
typedef struct __attribute((packed))
{
    uint8_t status;                         /**< Status code. */
    uint16_t destination;                   /**< Heartbeat publication destination. */
    uint8_t count_log;                      /**< Number of heartbeat messages to be sent. */
    uint8_t period_log;                     /**< Period of transmitted heartbeat messages. */
    uint8_t ttl;                            /**< TTL for heartbeat message. */
    uint16_t features;                      /**< Features triggering heartbeat messages. */
    config_msg_key_index_12_t netkey_index; /**< Index for the network key used to send heartbeats. */
} config_msg_heartbeat_publication_status_t;

/** Message format for the Heartbeat Subscription Set message. */
typedef struct __attribute((packed))
{
    uint16_t source;                        /**< Source of heartbeat messages. */
    uint16_t destination;                   /**< Destination of heartbeat messages. */
    uint8_t period_log;                     /**< Period of heartbeat messages. */
} config_msg_heartbeat_subscription_set_t;

/** Message format for the Heartbeat Subscription Status message. */
typedef struct __attribute((packed))
{
    uint8_t status;                         /**< Status code. */
    uint16_t source;                        /**< Source of heartbeat messages. */
    uint16_t destination;                   /**< Destination of heartbeat messages. */
    uint8_t period_log;                     /**< Period of heartbeat messages. */
    uint8_t count_log;                      /**< Number of heartbeat messages received. */
    uint8_t min_hops;                       /**< Least number of hops in received heartbeat messages. */
    uint8_t max_hops;                       /**< Largest number of hops in received heartbeat messages. */
} config_msg_heartbeat_subscription_status_t;

/** Message format for the Model App Bind/Unbind message. */
typedef struct __attribute((packed))
{
    uint16_t element_address;               /**< Unicast address of the element. */
    config_msg_key_index_12_t appkey_index; /**< Application key index. */
    config_model_id_t model_id;             /**< Model ID. */
} config_msg_app_bind_unbind_t;

/** Message format for the Model App Status message. */
typedef struct __attribute((packed))
{
    uint8_t status;                         /**< Status code. */
    uint16_t element_address;               /**< Unicast address of the element. */
    config_msg_key_index_12_t appkey_index; /**< Application key index. */
    config_model_id_t model_id;             /**< Model ID. */
} config_msg_app_status_t;

/** Possible values for the identity state. */
typedef enum
{
    CONFIG_IDENTITY_STATE_STOPPED     = 0x00, /**< The node identity advertisement is stopped. */
    CONFIG_IDENTITY_STATE_RUNNING     = 0x01, /**< The node identity advertisement is running. */
    CONFIG_IDENTITY_STATE_UNSUPPORTED = 0x02  /**< Node identity advertising is not supported. */
} config_identity_state_t;

/** Message format for the Node Identity Get message. */
typedef struct __attribute((packed))
{
    config_msg_key_index_12_t netkey_index; /**< Subnet index. */
} config_msg_identity_get_t;

/** Message format for the Node Identity Set message. */
typedef struct __attribute((packed))
{
    config_msg_key_index_12_t netkey_index; /**< Subnet index. */
    uint8_t identity_state;                 /**< Current state of the node identity advertisement. */
} config_msg_identity_set_t;

/** Message format for the Node Identity Status message. */
typedef struct __attribute((packed))
{
    uint8_t status;                         /**< Status code. */
    config_msg_key_index_12_t netkey_index; /**< Subnet index. */
    uint8_t identity_state;                 /**< Identity advertisement state. */
} config_msg_identity_status_t;

