NordicSemiconductor/nRF5-SDK-for-Mesh/models/config/include/config_messages.h
/** Message format for the Composition Data Get message. */
typedef struct __attribute((packed))
{
    uint8_t page_number; /**< Page-number for the composition data page to retrieve. */
} config_msg_composition_data_get_t;

/** Message format for the Composition Data Status message. */
typedef struct __attribute((packed))
{
    uint8_t page_number; /**< Page-number for the composition data page contained in this response. */
    uint8_t data[];      /**< Composition data. */
} config_msg_composition_data_status_t;

/** Values for the relay state. */
typedef enum
{
    CONFIG_RELAY_STATE_SUPPORTED_DISABLED = 0x00, /**< Relaying is supported, but disabled. */
    CONFIG_RELAY_STATE_SUPPORTED_ENABLED  = 0x01, /**< Relaying is supported and enabled. */
    CONFIG_RELAY_STATE_UNSUPPORTED        = 0x02  /**< Relaying is not supported. */
} config_relay_state_t;

/** Message format for the Relay Status message. */
typedef struct __attribute((packed))
{
    uint8_t relay_state;                         /**< Current state of the relaying feature. */
    uint8_t relay_retransmit_count          : 3; /**< Number of retransmissions per relayed packet. */
    uint8_t relay_retransmit_interval_steps : 5; /**< Number of 10 ms steps between retransmissions. */
} config_msg_relay_status_t;

/** Message format for the Relay Set message. */
typedef struct __attribute((packed))
{
    uint8_t relay_state;                         /**< Desired state of the relaying feature. */
    uint8_t relay_retransmit_count          : 3; /**< Desired number of retransmissions per relayed packed. */
    uint8_t relay_retransmit_interval_steps : 5; /**< Desired number of 10 ms steps between retransmissions. */
} config_msg_relay_set_t;

/** Message format for the Network Transmit Set message. */
typedef struct __attribute((packed))
{
    uint8_t network_transmit_count          : 3; /**< Desired number of retransmissions per packed. */
    uint8_t network_transmit_interval_steps : 5; /**< Desired number of 10 ms steps between retransmissions. */
} config_msg_network_transmit_set_t;

/** Message format for the Network Transmit Status message. */
typedef struct __attribute((packed))
{
    uint8_t network_transmit_count          : 3; /**< Number of retransmissions per transmited packet. */
    uint8_t network_transmit_interval_steps : 5; /**< Number of 10 ms steps between retransmissions. */
} config_msg_network_transmit_status_t;

/** Message format for the SIG/Vendor Model App Get message. */
typedef struct __attribute((packed))
{
    uint16_t element_address;   /**< Unicast address of the element. */
    config_model_id_t model_id; /**< Model ID. */
} config_msg_model_app_get_t;

/** Message format for the SIG Model App List message. */
typedef struct __attribute((packed))
{
    uint8_t status;           /**< Status code. */
    uint16_t element_address; /**< Unicast address of the element. */
    uint16_t sig_model_id;    /**< SIG model ID. */
    uint8_t key_indexes[];    /**< Key indexes. */
} config_msg_sig_model_app_list_t;

/** Message format for the Vendor Model App List message. */
typedef struct __attribute((packed))
{
    uint8_t status;             /**< Status code. */
    uint16_t element_address;   /**< Unicast address of the element. */
    uint16_t vendor_model_id;   /**< Vendor model ID. */
    uint16_t vendor_company_id; /**< Vendor company ID. */
    uint8_t key_indexes[];      /**< List of application key indexes. */
} config_msg_vendor_model_app_list_t;

/** Message format for the SIG/Vendor Model Subscription Get message. */
typedef struct __attribute((packed))
{
    uint16_t element_address;   /**< Unicast address of the element. */
    config_model_id_t model_id; /**< Model ID. */
} config_msg_model_subscription_get_t;

/** Message format for the SIG Model Subscription List message. */
typedef struct __attribute((packed))
{
    uint8_t status;           /**< Status code. */
    uint16_t element_address; /**< Unicast address of the element. */
    uint16_t sig_model_id;    /**< SIG model ID. */
    uint16_t subscriptions[]; /**< Subscription list. */
} config_msg_sig_model_subscription_list_t;

/** Message format for the Vendor Model Subscription List message. */
typedef struct __attribute((packed))
{
    uint8_t status;             /**< Status code. */
    uint16_t element_address;   /**< Unicast address of the element. */
    uint16_t vendor_model_id;   /**< Vendor model ID. */
    uint16_t vendor_company_id; /**< Vendor company ID. */
    uint16_t subscriptions[];   /**< Subscription list. */
} config_msg_vendor_model_subscription_list_t;

/*lint -align_max(pop) */
/** @} */

#endif

